// 配役パターン定義
export type Role = "村人" | "人狼" | "占い師" | "騎士" | "霊媒師" | "狂人" | "妖狐" | "共有者" | "狂信者" | "背徳者" | "ハンター" | "パン屋" | "てるてる" | "猫又" | "黒騎士" ;

export const rolePatterns: {
    [num: number]: Role[][];
} = {
    1: [ // テスト用
        ["村人"],
        ["人狼"],
        ["占い師"],
        ["騎士"],
        ["霊媒師"],
        ["狂人"],
        ["妖狐"],
        ["共有者"],
        ["狂信者"],
        ["背徳者"],
        ["ハンター"],
        ["パン屋"],
        ["てるてる"],
        ["猫又"],
        ["黒騎士"]
    ],
    3: [
        ["村人", "村人", "人狼"],
        ["村人", "人狼", "占い師"]
    ],
    4: [
        ["村人", "村人", "人狼", "占い師"],
        ["占い師", "人狼", "騎士", "狂人"],
        ["占い師", "人狼", "狂人", "ハンター"],
        ["占い師", "人狼", "騎士", "パン屋"],
        ["村人", "人狼", "占い師", "騎士"],
        ["村人", "狂信者", "ハンター", "ハンター"],
        ["村人", "人狼", "占い師", "てるてる"],
        ["人狼", "占い師", "騎士", "てるてる"],
        ["村人", "人狼", "占い師", "黒騎士"],
        ["村人", "占い師", "パン屋", "黒騎士"],
    ],
    // ...5人以上も追加可能
};